{
  "projects": [
    {
      "id": "0",
      "title": "Michelin Planning Web App",
      "short-description": "A tire production planning web app made for Michelin North America.",
      "long-description": "This web application was published in August 2023 for Michelin North America.  I worked on this web application development full stack over the course of three months during a co-op I did at NSCC.  I worked with an engineering student as a team who handled the project management aspect of this project.  This was my first major project working as a developer and my first project since my absence from IT.\n\nThe purpose of this application was to replace their old tire planning sheet which was created on a shared Excel spreadsheet.  This was a good method for them until the sheet started breaking over the years.  They also had issues with the sheet not being easy to extract data out of or import data into.  When they brought this challenge to me the app development broke down into some main requirements:\n\n- Recreate the sheet on a web application updating where needed but not changing too much.\n- Engineer the backend to more easily import and export data.\n- Fix issues with calculation discrepancies between sheets/columns.\n- Create a way to store old sheet onto the server and print the current sheet for the day.\n\nThe bulk of this projects time went into fully understanding the confusing sheet that they already had and finding how each number was calculated based on the given information.  The websites design is very simple and like the older Excel sheet, but I did end up adding some things and removing others.  The technology stack I used for the application was just a plan frontend stack with Bootstrap and for the backend I used ASP.NET and an MVC design pattern.  Overall, I am happy about this project considering my experience at the time but as now I realized all the changes I would have made.",
      "thumbnail": "/assets/project-images/michelin-tire-planning-thumbnail.png",
      "images": ["/assets/project-images/michelin-tire-planning-0.png"],
      "date": "25-08-2023",
      "lang-icons": ["/assets/lang-logos/javascript.svg", "/assets/lang-logos/cSharp.svg", "/assets/lang-logos/dotnetcore.svg", "/assets/lang-logos/microsoftsqlserver.svg"]
    },
    {
      "id": "1",
      "title": "Andriod Weather App",
      "short-description": "An Android app that fetches live weather of any location and save to the device.",
      "long-description":"This is my final project for my Mobile Development course at NSCC in 2023.  This project has a lot of great fundamentals in it that helped me understand the structure of an android application.  The application itself is a fully functional multi-screen weather applications that fetches to an API, parses the response model, and saves it to the device`s memory as an entity.  This was all done in Android Studio in Kotlin.\n\n  I am particularly proud of this project, not only because how smooth it feels but because of the project completion conditions.  I wanted to finish up some courses before I worked on a larger project for others, so I spent a day just working on this.  I felt as if it was a challenge, but a good challenge and it made me learn how everything was running more in depth than before.  The next day when I headed to class the prof announced that he was modifying the projects requirements because he felt as it was too hard for the class.  I emailed him abut this and he said it was fine.  I ended up finishing my Android course with a 100%.",
      "thumbnail": "/assets/project-images/weather-app-thumbnail.png",
      "images": ["/assets/project-images/weather-app-0.png"],
      "date": "08-12-2023",
      "lang-icons": ["/assets/lang-logos/android-studio.svg", "/assets/lang-logos/kotlin.svg"],
      "github": "https://github.com/LethalPie/NSCC2023/tree/main/WeatherForecastAndriodApp"
    },
    {
      "id": "2",
      "title": "Scenario Tracker (Frosthaven)",
      "short-description": "My boardgame passion in a React web app and more.",
      "long-description":"This was my final project for Web Development and Advanced OOP at NSCC in 2023.  The projects were both assigned by the same professor, and I got permission to use Java for a backend and use React + TypeScript as my front end.  This was my first ever project in React + TypeScript and I ended up learning a lot from the mistakes I made, but also made and excellent product.\n\nAt the time when coming up with ideas for a project I was very into the board game Frosthaven.  In the game you quest through scenarios and follow a story.  What I wanted to achieve with this project was to make a web app that people could login into, track their progress in the game and have it saved to a database.  I started with the backend of this project in SpringBoot where I created an API to perform CRUD on users.  I used MongoDB as my database for this as well as storing information on the classes in the game.\n\nMy first time using React I found the framework very intuitive.  Although this project is missing some key parts of the framework, I enjoyed the basic aspects of it and have improved since.  This was also my first-time using TypeScript but having a background of JavaScript it wasn`t that hard to get writing in it and I have since used it more.  The project front end project itself was enjoyable to make and has sparked a love for React.",
      "thumbnail": "/assets/project-images/frosthaven-scenario-tracker-thumbnail.png",
      "images": ["/assets/project-images/frosthaven-scenario-tracker-0.png","/assets/project-images/frosthaven-scenario-tracker-1.png"],
      "date": "14-12-2023",
      "lang-icons": ["/assets/lang-logos/react.svg", "/assets/lang-logos/typescript.svg", "/assets/lang-logos/spring.svg", "/assets/lang-logos/mongodb.svg"],
      "github": "https://github.com/LethalPie/FrosthavenScenarioProgress"
    },
    {
      "id": "3",
      "title": "Website Launched!",
      "short-description": "My portfolio website is now live!",
      "long-description":"Hello I`m Eliphalet!  My portfolio website is now live!  I am excited to have this website finally launched with some work samples to boot.  I`ll be periodically updating this website with project of note from my course at NSCC or any other project I am working on.\n\nThe website is 100% made by me in React + TypeScript.  The website is a project for me and the most important thing I learnt was how to style better.  My previous project in React was that pretty and I`m liking the look and feel of this website a lot more.  I also extended my knowledge in React this project and I feel like I have a deeper understanding of the framework than before.\n\nWant to connect with me?  Check me out on LinkedIn or give me an email if you want to work together or want a copy of my resume!",
      "thumbnail": "/assets/project-images/website-launched-thumbnail.png",
      "images": ["/assets/project-images/website-launched-0.png"],
      "date": "17-03-2024",
      "lang-icons": ["/assets/lang-logos/react.svg", "/assets/lang-logos/typescript.svg"],
      "github": "https://github.com/LethalPie/LethalPiePortfolioWebPage"
    }
  ]
}